
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок= Новый ТабличныйДокумент;
	ПечатьНаСервере(ТабДок,ПараметрКоманды);
	ТабДок.Показать("Печать");
КонецПроцедуры

&НаСервере
Процедура ПечатьНаСервере(ТабДок,СсылкаНаДокумент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Номер КАК Номер,
		|	РасходнаяНакладная.Дата КАК Дата,
		|	РасходнаяНакладная.Клиент КАК Клиент,
		|	РасходнаяНакладная.Склад КАК Склад,
		|	РасходнаяНакладная.Склад.АдресСклада КАК СкладАдресСклада,
		|	РасходнаяНакладная.СуммаДокумента КАК СуммаДокумента,
		|	РасходнаяНакладная.КоличествоНоменклатуры КАК КоличествоНоменклатуры
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.Ссылка = &СсылкаНаДокумент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходнаяНакладнаяТовары.НомерСтроки КАК Номер,
		|	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
		|	РасходнаяНакладнаяТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	РасходнаяНакладнаяТовары.Количество КАК Количество,
		|	РасходнаяНакладнаяТовары.Цена КАК Цена,
		|	РасходнаяНакладнаяТовары.Сумма КАК Сумма
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
		|ГДЕ
		|	РасходнаяНакладнаяТовары.Ссылка = &СсылкаНаДокумент";
	
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
	
	МассивРезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки=МассивРезультатЗапроса[0];
	ДанныеТовары=МассивРезультатЗапроса[1];
	
	ВыборкаШапка= ДанныеШапки.Выбрать();
	ВыборкаШапка.Следующий();
	ВыборкаТовары=ДанныеТовары.Выбрать();
	
Макет=Документы.РасходнаяНакладная.ПолучитьМакет("Печать");

//Заголовок
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	ТабДок.Вывести(ОбластьЗаголовок);
	
	//Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьШапка.Параметры.Номер      =ВыборкаШапка.Номер;
	
		ОбластьШапка.Параметры.Дата   =ВыборкаШапка.Дата;
		
	ОбластьШапка.Параметры.Клиент     =ВыборкаШапка.Клиент;
	
	ОбластьШапка.Параметры.Склад      =ВыборкаШапка.Склад;
	
	ОбластьШапка.Параметры.АдресСклада=ВыборкаШапка.СкладАдресСклада;
	
ТабДок.Вывести(ОбластьШапка);

//Товары Шапка

	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ТабДок.Вывести(ОбластьТоварыШапка);
	
	//Товары
	
	Пока ВыборкаТовары.Следующий()  Цикл
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	
	ОбластьТовары.Параметры.НомерСтроки=ВыборкаТовары.Номер;
	
	ОбластьТовары.Параметры.Номенклатура=ВыборкаТовары.Номенклатура;
	
	ОбластьТовары.Параметры.ЕдиницаИзмерения=ВыборкаТовары.ЕдиницаИзмерения;
	
	ОбластьТовары.Параметры.Цена=ВыборкаТовары.Цена;
	
	ОбластьТовары.Параметры.Количество=ВыборкаТовары.Количество;
	
	ОбластьТовары.Параметры.Сумма=ВыборкаТовары.Сумма;
	
	ТабДок.Вывести(ОбластьТовары);
КонецЦикла;

//Подвал
ОбластьПодвал=Макет.Получитьобласть("Подвал");

ОбластьПодвал.Параметры.КоличествоНоменклатуры=ВыборкаШапка.КоличествоНоменклатуры;

ОбластьПодвал.Параметры.СуммаДокумента=ВыборкаШапка.СуммаДокумента;

ТабДок.Вывести(ОбластьПодвал);
КонецПроцедуры 
