Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента=Товары.Итог("Сумма");
	КоличествоНоменклатуры=Товары.Итог("Количество");
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОстаткиТоваров Расход
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		Движение = Движения.ОстаткиТоваров.Добавить();
		
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		
		Движение.Период = Дата;
		
		Движение.Склад = Склад;
		
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		
		Движение.Количество = ТекСтрокаТовары.Количество;
		
		Движение.Сумма = ТекСтрокаТовары.Сумма;
	КонецЦикла;

КонецПроцедуры

